import numpy as np

test2 = np.array([
  [
    [0.1, 0.2],
    [0.9, 0.8],
  ],
  [
    [0.2, 0.2],
    [0.8, 0.8],
  ],
])
test3 = np.array([
  [
    [0.1, 0.1],
    [0.2, 0.2],
    [0.3, 0.3],
  ],
  [
    [0.1, 0.1],
    [0.3, 0.3],
    [0.6, 0.6],
  ],
])
test5 = np.array([
  [
    [0.2, 0.2 ],  
    [0.05,0.05], 
    [0.15,0.15], 
    [0.35,0.35], 
    [0.25,0.25], 
  ], 
  [ 
    [0.1 , 0.1 ], 
    [0.4 , 0.4 ], 
    [0.15, 0.15], 
    [0.2 , 0.2 ], 
    [0.15, 0.15], 
  ],
])

prs2 = np.array([
  [
    [0.88, 0.65],
    [0.12, 0.35],
  ],
  [
    [0.35, 0.7],
    [0.65, 0.3],
  ],
  [
    [0.75, 0.98],
    [0.25, 0.02],
  ],
  [
    [0.27, 0.6],
    [0.73, 0.4], 
  ],
  [
    [0.6, 0.55],
    [0.4, 0.45], 
  ],
  [
    [0.37, 0.29],
    [0.63, 0.71], 
  ],
  [
    [0.76, 0.4],
    [0.24, 0.6], 
  ],
  [
    [0.81, 0.37],
    [0.19, 0.63], 
  ],
  [
    [0.22, 0.43],
    [0.78, 0.57], 
  ],
  [
    [0.75, 0.4],
    [0.25, 0.6], 
  ],
  [
    [0.36, 0.32],
    [0.64, 0.68], 
  ],
  [
    [0.34, 0.53],
    [0.66, 0.47], 
  ],
  [
    [0.69, 0.41],
    [0.31, 0.59], 
  ],
  [
    [0.53, 0.26],
    [0.47, 0.74], 
  ],
])
'''
X : Xを選ぶ
A : 理系である
P(X:A) : 理系がXを選ぶ確率
P(A:X) : Xを選んだ人が理系である確率

|       |     A    |    ￢A   |
| :---  |   :---   |   :---   |
|  ￢X  | P(￢X:A) | P(￢X:￢A)|
|    X  |  P(X:A)  | P(X:￢A) |
'''

prs3 = np.array([
  [
    [0.5, 0.22],
    [0.3, 0.5],
    [0.2, 0.28],
  ],
  [
    [0.1, 0.44],
    [0.4, 0.4],
    [0.5, 0.16],
  ]
])

prs5 = np.array([
  [
    [0.2, 0.2 ],  
    [0.05,0.43], 
    [0.15,0.2], 
    [0.35,0.05], 
    [0.25,0.12], 
  ], 
  [ 
    [0.1 , 0.4 ], 
    [0.4 , 0.1 ], 
    [0.15, 0.15], 
    [0.2 , 0.15 ], 
    [0.15, 0.2], 
  ],
  [
    [0.25,0.25],
    [0.3 ,0.3 ],
    [0.1 ,0.15 ],
    [0.05,0.1],
    [0.3 ,0.2 ],
  ], 
  [
    [0.1 , 0.3 ],
    [0.2 , 0.2 ],
    [0.15, 0.25],
    [0.3 , 0.15 ],
    [0.25, 0.1],
  ], 
  [
    [0.45, 0.15],
    [0.2 , 0.2 ],
    [0.05, 0.25],
    [0.2 , 0.2 ],
    [0.1 , 0.2],
  ], 
  [
    [0.2, 0.3], 
    [0.1, 0.2], 
    [0.1, 0.15], 
    [0.3, 0.25], 
    [0.3, 0.1], 
  ]
])

lb_q = [
  "宿題は必ずやる方だ", 
  "パソコンを使うのが好きだ", 
  "表やデータをよく使う", 
  "夜ふかしを良くする方だ", 
  "授業に関してよく先生に質問するほうだ", 
  "興味のあることについてネットでよく調べる方だ", 
  "人に流される方だ", 
  "授業内容はきれいにノートにまとめている方だ", 
  "授業中に内職を良くする方だ", 
  "提出物はコツコツ進める方だ", 
  "よく遅刻する方だ", 
  "細かいことにこだわる方だ", 
  "きれい好きな方だ", 
  "学校行事に積極的に参加する方だ", 

  "どんな場所に住みたいか", 
  "わからない問題に出会ったとき", 

  "好きな本の種類", 
  "今後やってみたい趣味", 
  "初デートで遊ぶ場所", 
  "急に午後の予定がなくなったらどうするか？", 
  "家電(ガジェット)を買うとき", 
  "朝ごはんと一緒に飲むものは"
]

lb_choices = [
  ["田舎", "都会", "海外"], 
  ["答えをすべて丸暗記する", "解けるるようになるように復習する", "問題と連動して覚える"], 
  ["漫画", "小説", "自己啓発", "科学雑誌", "ラノベ"],
  ["読書", "プログラミング", "筋トレ", "ゲーム","音楽"], 
  ["カフェ", "映画", "ボウリング", "カラオケ", "図書館"], 
  ["人と会う", "読書する", "運動する", "細かい予定を立てる", "ボーっとする"], 
  ["性能", "見た目", "人気", "値段", "直観"], 
  ["水", "お茶", "牛乳", "ジュース", "コーヒー"], 
]
